When done, evaluate buffer with =org-table-recalculate-buffer-tables=.
* About
1. Each heading must have an =ID=.
   + That =ID= will be used to calculate things remotely.
   + Get that ID with =org-id-store-link=.
2. Each table has to have as =#+NAME:= the output of =org-insert-link=.
3. Same procedure as step 2 for calculation of remote tables; you have
   to insert the link with no other links stored between steps. This
   applies for 'Total' headings and their corresponding table.



- No links must be stored between step 1 and 2, otherwise when you insert
  the link in step 2 you will insert a non-related link.

* subject1
** Teórica ab%
#+NAME: < insert here output of =org-insert-link= >
| Item     | Nota |
|----------+------|
| prueba1  |  3.6 |
| prueba2  |  6.0 |
|----------+------|
| Promedio |  4.8 |
#+TBLFM: @>$>=vmean(@I..II)
** Práctica cd%
#+NAME: < insert here output of =org-insert-link= >
| Item     |  Nota |
|----------+-------|
| taller1  |   5.1 |
| taller2  |   3.0 |
| taller3  |   5.2 |
| taller4  |   6.0 |
|----------+-------|
| Promedio | 4.825 |
#+TBLFM: @>$>=vmean(@I..II)
** Total
#+NAME: < insert here output of =org-insert-link= >
| Prueba   | Ponderación |  Nota | Nota ponderada |
|----------+-------------+-------+----------------|
| Teórica  | 0.ab        | 3.304 |         2.6432 |
| Práctica | 0.cd        |   6.1 |           1.22 |
|----------+-------------+-------+----------------|
| Promedio | 1.          |     - |         3.8632 |
#+TBLFM: @2$3=remote([[id:a592c...][Teórica ab%]],@>$>) :: @3$3=remote([[id:b1ab...][Práctica cd%]],@>$>) :: $4=$2*$3 :: @4$4=vsum(@I..II) :: @>$2=vsum(@I..II)
* Total
#+NAME: < insert here output of =org-insert-link= >
|----------+---------|
| Subject  |   Grade |
|----------+---------|
| subject1 |  3.8632 |
| subject1 |  4.8075 |
|----------+---------|
| Promedio | 4.33535 |
|----------+---------|
#+TBLFM: @2$2=remote([[id:785f...][Total]],@>$>) :: @3$2=remote([[id:777f9...][Total]],@>$>) :: @4$2=remote([[id:ad1cf9...][Total]],@>$>) :: @>$>=vmean(@II..III)
